---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures
source: html/3633d562-0e24-5cad-ec0f-02e6cc6ad731.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures

Failures about AnalyticalModel.

## Syntax (C#)
```csharp
public static class AnalyticalModelFailures
```